<a href="https://colab.research.google.com/github/Asirante/Python_2020_Basic/blob/master/7%EC%9D%BC%EC%B0%A8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**공공데이터**

In [0]:
from google.colab import drive
import pandas as pd

In [0]:
path = '/content/sample_data/'

In [0]:
df = pd.read_csv(path+'california_housing_train.csv')

In [10]:
df

       longitude  latitude  ...  median_income  median_house_value
0        -114.31     34.19  ...         1.4936             66900.0
1        -114.47     34.40  ...         1.8200             80100.0
2        -114.56     33.69  ...         1.6509             85700.0
3        -114.57     33.64  ...         3.1917             73400.0
4        -114.57     33.57  ...         1.9250             65500.0
...          ...       ...  ...            ...                 ...
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[17000 rows x 9 columns]

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17000 entries, 0 to 16999
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           17000 non-null  float64
 1   latitude            17000 non-null  float64
 2   housing_median_age  17000 non-null  float64
 3   total_rooms         17000 non-null  float64
 4   total_bedrooms      17000 non-null  float64
 5   population          17000 non-null  float64
 6   households          17000 non-null  float64
 7   median_income       17000 non-null  float64
 8   median_house_value  17000 non-null  float64
dtypes: float64(9)
memory usage: 1.2 MB

In [17]:
df.head()

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0

[5 rows x 9 columns]

In [0]:
covid_data_path = '/content/drive/My Drive/Colab Notebooks/COVID.csv'
df2 = pd.read_csv(covid_data_path, encoding='cp949')

In [26]:
df2

            시군구       의료기관명  진료과수  ...  국민안심병원 여부 감염병전담기관 여부 감염병전담기관 외래진료 가능여부
0       강원도 강릉시      강릉동인병원    21  ...        NaN        NaN               NaN
1       강원도 강릉시     박정빈외과의원     1  ...        NaN        NaN               NaN
2       강원도 강릉시     이명호내과의원     1  ...        NaN        NaN               NaN
3       강원도 고성군       세브란의원     4  ...        NaN        NaN               NaN
4       강원도 동해시  근로복지공단동해병원    10  ...          Y        NaN               NaN
..          ...         ...   ...  ...        ...        ...               ...
314  충북 청주시 청원구      초정노인병원     3  ...        NaN        NaN               NaN
315  충북 청주시 흥덕구      청주현대병원     4  ...        NaN        NaN               NaN
316      충북 충주시     건국대충주병원    23  ...          Y        NaN               NaN
317      충북 충주시      송원요양병원     2  ...        NaN        NaN               NaN
318      충북 충주시   충주시노인전문병원     4  ...        NaN        NaN               NaN

[319 rows x 9 columns]

In [27]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 319 entries, 0 to 318
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   시군구                319 non-null    object
 1   의료기관명              319 non-null    object
 2   진료과수               319 non-null    int64
 3   병상수                319 non-null    int64
 4   전화번호               319 non-null    object
 5   주소                 319 non-null    object
 6   국민안심병원 여부          72 non-null     object
 7   감염병전담기관 여부         26 non-null     object
 8   감염병전담기관 외래진료 가능여부  26 non-null     object
dtypes: int64(2), object(7)
memory usage: 22.6+ KB

In [0]:
man = [[1,1,1],[2,2,2],[3,3,3]]
df3 = pd.DataFrame(man)

In [0]:
df3.index = ['a','b','c']
df3.columns = ['1차','2차','3차']

In [50]:
df4 = df3[['1차','2차']]
df4

   1차  2차
a   1   1
b   2   2
c   3   3

In [51]:
df3['1차']==2

a    False
b     True
c    False
Name: 1차, dtype: bool

In [67]:
df4['합계'] = df3['1차'] + df3['2차']
df4

   1차  2차  합계
a   1   1   2
b   2   2   4
c   3   3   6

In [70]:
df5 = df2[['병상수','진료과수']]
df5

     병상수  진료과수
0    608    21
1      0     1
2      0     1
3      0     4
4    499    10
..   ...   ...
314  150     3
315  150     4
316  464    23
317  105     2
318  120     4

[319 rows x 2 columns]